Revit 2027 API
ColorOptions.AlertColor Property
 The color of the current canvas theme used to highlight elements when a special alert is required.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Color AlertColor { get; set; }
Public Property AlertColor As Color
	Get
	Set
public:
property Color^ AlertColor {
	Color^ get ();
	void set (Color^ value);
}
member AlertColor : Color with get, set
Property Value
Color
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
ColorOptions Class
Autodesk.Revit.DB Namespace